{
  "document_id": "gai-esp_corpus-item004",
  "content": {
    "sections": [
      {
        "id": "section_1",
        "title": null,
        "paragraphs": [
          {
            "id": "p1_1",
            "text": "La UNESCO presentó este miércoles, en el Senado de la República, la evaluación del estado de preparación de la inteligencia artificial en México. La Recomendación sobre la Ética de la Inteligencia Artificial (RAM) fue presentada por Gabriela Ramos, Directora General Adjunta para las Ciencias Sociales y Humanas de la UNESCO."
          },
          {
            "id": "p1_2",
            "text": "México está pisando fuerte para lograr una hoja de ruta nacional para el desarrollo y uso ético de la inteligencia artificial. Este miércoles, la UNESCO presentó la evaluación del estado de preparación de México para la inteligencia artificial, bajo el liderazgo de Gabriela Ramos, Directora General Adjunta para las Ciencias Sociales y Humanas de la UNESCO, con el apoyo de Centro-i para la Sociedad del Futuro y la Alianza Nacional de Inteligencia Artificial (ANIA), que lidera la senadora Alejandra Lagunes."
          },
          {
            "id": "p1_3",
            "text": "La UNESCO en colaboración con la ANIA desarrolló el reporte del estadío de la preparación de la IA de México. Se trata de un análisis detallado de las fortalezas y oportunidades de México para fomentar un ecosistema de inteligencia artificial responsable. Tras 15 meses de esfuerzo conjunto, 18 mesas de trabajo, 90 eventos y la participación de más de 340 expertos en más de 500 horas de diálogo, esta cooperación entre la ANIA, el Centro-i y la UNESCO ha logrado resultados significativos en el desarrollo de la inteligencia artificial en México."
          },
          {
            "id": "p1_4",
            "text": "\"Gracias por su tiempo, trabajo y confianza. Por los documentos compartidos, por la investigación, las entrevistas. Ustedes han sido quienes construyeron este legado que está haciendo historia\", dijo Alejandra Lagunes, al inicio del evento en el Senado de la República. Alejandra Lagunes es Secretaria de la Mesa Directiva y de la Comisión de Derechos Digitales, Integrante de la Comisión Ciencia y Tecnología, Salud, Medio Ambiente, Recursos Naturales y Cambio Climático."
          },
          {
            "id": "p1_5",
            "text": "Además, es fundadora y líder de la Alianza Nacional de Inteligencia Artificial (ANIA), un mecanismo que tiene como misión reconocer y fortalecer el ecosistema de IA en México con una perspectiva integral, plural y multidisciplinaria, con el objetivo de desarrollar recomendaciones de política pública, regulación y modelo de gobernanza. Como líder de la ANIA ha publicado artículos de opinión sobre diversos temas relacionados con la tecnología y las políticas públicas, y ha participado en conferencias, paneles y foros internacionales para compartir sus conocimientos y experiencia."
          },
          {
            "id": "p1_6",
            "text": "\"La inteligencia artificial traerá un cambio civilizatorio. Un cambio de era. Una transformación del contrato social. Para 2030, 50% de los empleos mundiales se transformarán. Para el 2050, 75% de los empleos estarán relacionados con la IA. La inteligencia artificial generará 4.4 trillones de dólares anuales en productividad, y 13 billones de dólares en valor agregado en la economía mundial. Impactará absolutamente a todos los sectores productivos\", dijo la senadora Lagunes."
          },
          {
            "id": "p1_7",
            "text": "Según la OCDE, 79 países han presentado más de 1,000 propuestas relacionadas con la inteligencia artificial, que abarcan desde iniciativas de ley y estrategias hasta políticas públicas, agendas y cambios nacionales. En México, se han presentado 43 iniciativas en el Senado y la Cámara de Diputados."
          },
          {
            "id": "p1_8",
            "text": "\"Así, hace 15 meses, se crea la Alianza Nacional de Inteligencia Artificial (ANIA), un mecanismo abierto y colaborativo. Lo que nos unió fue la visión de recalibrar el debate. Tenemos claro que la discusión no debía ser tecnológica ni económica, sino social y ética, con el ser humano y su bienestar al centro, que encontremos la solución a los problemas locales y globales. Para cerrar las brechas y terminar con las grandes desigualdades y los sesgos; que se utilice para el desarrollo sostenible con respeto a la dignidad, a los derechos humanos y a los valores democráticos, que definamos cuál es la relación que queremos con esta tecnología, que decidamos cuál es nuestra vocación como país, que logremos detonar la innovación y equilibrar el desarrollo tecnológico con la autorregulación\"."
          }
        ]
      },
      {
        "id": "section_2",
        "title": "¿En qué consiste la Recomendación sobre Ética de Inteligencia Artificial (RAM, por sus siglas en inglés)?",
        "paragraphs": [
          {
            "id": "p2_1",
            "text": "La RAM es una herramienta clave para apoyar a los Estados Miembros en la implementación de la Recomendación de la UNESCO sobre la Ética de la IA. Al proporcionar información detallada y completa sobre diferentes dimensiones de la preparación para la IA, ayuda a resaltar cualquier brecha institucional y regulatoria, y permite a la UNESCO ajustar su apoyo a los gobiernos para llenar esas brechas, con el fin de asegurar un ecosistema de IA ético."
          },
          {
            "id": "p2_2",
            "text": "La Readiness Assessment Methodology (RAM) incluye una variedad de preguntas cuantitativas y cualitativas diseñadas para recopilar información sobre diferentes dimensiones relacionadas con el ecosistema de IA de un país, incluidas las dimensiones legales y regulatorias, sociales y culturales, económicas, científicas y educativas, y tecnológicas e infraestructurales. Cada dimensión presenta una serie de preguntas de evaluación cuantitativas y cualitativas, lo que distingue a la RAM de otras herramientas de evaluación de preparación existentes."
          },
          {
            "id": "p2_3",
            "text": "\"México, al igual que otras naciones, enfrenta enormes desafíos para lograr el desarrollo ético de la IA. Desde 2018, el gobierno de México ha participado activamente en foros internacionales sobre estos temas, poniendo en marcha una iniciativa para elaborar una estrategia nacional digital que incluyera explícitamente a la IA. México ha formado parte de los grupos de trabajo de la ONU y ha liderado varias iniciativas en la Red de América Latina y el Caribe para el Desarrollo de Gobiernos Digitales. Sin embargo, desde entonces, otros países con niveles de desarrollo similares han logrado avances significativos, mientras que México se ha rezagado en sus posiciones de liderazgo en esta materia\", dijo Gabriela Ramos, Directora General Adjunta para las Ciencias Sociales y Humanas de la UNESCO."
          },
          {
            "id": "p2_4",
            "text": "La implementación de la RAM se adapta a las circunstancias y características únicas del país, así como al presupuesto disponible para el proyecto. Se espera que la RAM sea llevada a cabo por un consultor independiente u organización de investigación, apoyado por un equipo nacional que comprenda una variedad de partes interesadas, como personal de la Secretaría de la UNESCO y la Comisión Nacional de la UNESCO, así como representantes del gobierno del país, la comunidad académica, la sociedad civil y el sector privado, entre otros. Además de la finalización del cuestionario RAM, el resultado final del ejercicio RAM incluye la creación de un informe nacional que proporciona una visión general completa del estado de preparación para la IA en el país, resumiendo dónde se encuentra el país en cada dimensión, detallando las actividades en curso, resumiendo el estado del arte y proporcionando recomendaciones políticas concretas sobre cómo abordar las brechas de gobernanza. Este informe ayuda a identificar en detalle los cambios institucionales necesarios para elaborar o fortalecer la estrategia nacional de IA y permite a la UNESCO ajustar los esfuerzos de desarrollo de capacidades a las necesidades específicas del país."
          }
        ]
      },
      {
        "id": "section_3",
        "title": "¿Qué ha hecho México para el desarrollo, uso y aplicación ética, legal y responsable de la IA?",
        "paragraphs": [
          {
            "id": "p3_1",
            "text": "México se ha sumado a más de 60 países que están desarrollando la metodología RAM, de la UNESCO. Con la presentación de hoy de la RAM, y la Propuesta de Agenda Nacional de la Inteligencia Artificial para México 2024-2030, anunciada el pasado 15 de mayo, se cumple con el primer objetivo que se planteó desde la ANIA, que fue generar un diagnóstico y propuestas de regulación, política pública y modelo de gobernanza de la IA para el país."
          },
          {
            "id": "p3_2",
            "text": "Además, se presentó una iniciativa de Reforma Constitucional al artículo 73 para facultar al Congreso de legislar en inteligencia artificial, ciberseguridad y neuroderecho, que fue firmada por todos los grupos parlamentarios. México ha colaborado con la Embajada de Reino Unido y la Asociación Mexicana de Ciberseguridad para desarrollar un marco regulatorio y ético. También, en colaboración todo el ecosistema relacionado con la IA, se ha desarrollado un sandbox que se presentará en la Comisión Permanente del Senado de la República. Además, han capacitado a miles de personas en IA, y documentando casos de uso. Firmaron una colaboración con la Cámara Nacional de Comercio (CANACO) para capacitar a 10,000 PyMes."
          },
          {
            "id": "p3_3",
            "text": "\"Hoy, presentaré en la Comisión Permanente dos iniciativas, una que moderniza y dota al Instituto Belisario Domínguez del Senado de la República de facultades para dar asesoramiento técnico en materia de nuevas tecnologías; y otra que busca implementar el parlamento abierto; también, Instituto Belisario Domínguez, estamos creando un acuerdo de colaboración para que la ANIA sea un órgano consultivo en temas de tecnologías emergentes y de futuro\", dijo la senadora Alejandra Lagunes."
          }
        ]
      },
      {
        "id": "section_4",
        "title": "Mensajes Claves sobre la IA en México",
        "paragraphs": [
          {
            "id": "p4_1",
            "text": "Actualmente, el país aún no cuenta con un plan o estrategia nacional de IA. Sin embargo, México tiene importantes fortalezas en su marco jurídico, protección de derechos humanos, privacidad y protección de datos, que pueden servir como base para el desarrollo de una estrategia integral."
          },
          {
            "id": "p4_2",
            "text": "Según el Índice Latinoamericano de Inteligencia Artificial (ILIA), el uso de IA por parte de empresas privadas en México es bajo en comparación con otros países de América Latina, con una puntuación de 12.5, frente a un promedio de 25 en la región. A pesar de esto, México se destaca en avances públicos, ocupando el tercer lugar en LATAM, después de Argentina y Uruguay."
          },
          {
            "id": "p4_3",
            "text": "En 2022, México tuvo 2,670 graduados de programas de maestría en ciencias de la computación o equivalentes, el mayor número en Latinoamérica. Además, el país ha logrado avances moderados en la integración de tecnología en la educación. Sin embargo, los niveles de escolaridad siguen siendo bajos y persiste una gran brecha de género en carreras STEM."
          },
          {
            "id": "p4_4",
            "text": "La producción científica en IA es baja en comparación con los estándares internacionales. Sin embargo, a nivel regional, México y Brasil poseen el 95% de las patentes de IA en Latinoamérica, según el ILIA. México se ubica en sexto lugar en la región en número de investigadores que trabajan específicamente en IA, después de Chile, Ecuador, Brasil, Uruguay y Colombia."
          },
          {
            "id": "p4_5",
            "text": "Aunque México lidera en inversión pública en I+D en Latinoamérica, su gasto total (público y privado) en I+D fue de 0.28% del PIB en 2021, comparado con un promedio de 0.56% para Latinoamérica y el Caribe, y un promedio de 2.72% en países miembros de la OCDE."
          }
        ]
      },
      {
        "id": "section_5",
        "title": "Principales Recomendaciones de la UNESCO",
        "paragraphs": [
          {
            "id": "p5_1",
            "text": "En primer lugar, la UNESCO sugiere elaborar un mapa funcional del ecosistema de IA. En segundo lugar, integrar un marco jurídico específico para regular la inteligencia artificial. Además, se propone crear un diseño institucional y de gobernanza para la IA. Finalmente, se recomienda emitir la Estrategia Nacional de Inteligencia Artificial."
          },
          {
            "id": "p5_2",
            "text": "Innovar en el diseño de instrumentos regulatorios ágiles: Crear regulaciones flexibles que se adapten al rápido avance tecnológico e incluyan mecanismos para el aprendizaje y la mejora continua."
          },
          {
            "id": "p5_3",
            "text": "Definir políticas públicas inclusivas para el desarrollo de IA: Establecer políticas que promuevan el desarrollo de la inteligencia artificial con fines de interés público, garantizando el acceso equitativo a la IA, los datos y el poder de cómputo, evitando así la creación de brechas tecnológicas."
          },
          {
            "id": "p5_4",
            "text": "Coordinación con otros órganos y poderes del Estado: Colaborar estrechamente con el sector privado, la academia y la sociedad civil para asegurar una efectiva coordinación y cooperación interinstitucional."
          },
          {
            "id": "p5_5",
            "text": "Identificación de activos y servicios críticos: Desarrollar estrategias específicas para la prevención y detección de amenazas, diferenciando claramente entre la seguridad nacional y la seguridad ciudadana."
          },
          {
            "id": "p5_6",
            "text": "Incorporación de principios fundamentales: Garantizar que la ciberseguridad, privacidad, transparencia, inclusión, ética y perspectiva de género sean componentes transversales en la estrategia nacional de IA."
          }
        ]
      }
    ],
    "figures": [
      {
        "id": "figure_1",
        "caption": "Esta mañana, la UNESCO presentó en el Senado de la República la evaluación del estadío de preparación de la inteligencia artificial en México, de la mano de Gabriela Ramos, Directora Adjunta para las Ciencias Sociales y Humanas de la Unesco y Alejandra Lagunes, líder de la Alianza Nacional de Inteligencia Artificial (ANIA)."
      },
      {
        "id": "figure_2",
        "caption": "Alejandra Lagunes, líder de la Alianza Nacional de Inteligencia Artificial (ANIA)."
      }
    ]
  }
}